// Common Strings
"Okay" = "OK";
"Cancel" = "Abbrechen";

// Servers
"RFBDefaultServerName" = "Neuer Server";
"RFBUntitledServerName" = "Unbenannter Server";
"Connecting..." = "Verbinden...";
"Connect" = "Verbinden";
"DisplayIsPort" = "Bildschirm %d ist Port %d";
"PortIsDisplay" = "Port %d ist Bildschirm %d";
"PortNum" = "Port %d";

// Error Actions
"OpenConnection" = "Verbindung öffnen";
"NoNamedServer" = "Server mit dem Namen \"%@\" konnte nicht gefunden werden";
"NoConnection" = "Mit dem Server %@ auf Port %d konnte keine Verbindung aufgebaut werden";
"NoReconnection" = "Das Wiederverbinden mit dem Server %@ ist fehlgeschlagen";
"NotVNC" = "Kein VNC Server";
"UnknownAuthType" = "Unbekannter authType %@";
"UnknownAuthResult" = "Unbekanntes authResult %@";
"AuthenticationFailed" = "Authentifizierung fehlgeschlagen";
"AuthenticationFailedTooMany" = "Authentifizierung fehlgeschlagen (zu viele Fehlversuche)";
"AuthenticationRequired" = "Authentifizierung benötigt";
"UnknownMessageType" = "Unbekannter Nachrichtentyp %@";
"UnknownMessageTypeLastEncoding" = "Unbekannter Nachrichtentyp %@. (Vorherige Enkodierung war %@)";
"ServerReports" = "Server Nachricht";
"ARDAuthWarning" = "Der Server akzeptiert nur Apple Remote Desktop Klienten. Bitte ändern Sie die Einstellungen auf dem Server um andere VNC Klienten zu erlauben.";

// Profiles
"defaultProfileName" = "Standard Profil";
"EditProfiles" = "Verbindungsprofile editieren...";

// Couldn't connect
"ConnectRefused" = "Der Server hat die Verbindung abgelehnt";
"ConnectTimedOut" = "Es ist eine Zeitüberschreitung bei der Verbindung aufgetreten";

// SSH-related errors
"SshError" = "SSH Verbindung zum Server %@ konnte nicht hergestellt werden";
"SshKeyMismatch" = "Die entfernte SSH Identifizierung hat sich geändert. Wird die Verbindung mitgehört?";
"SshCatError" = "cat Fehler";
"SshScriptError" = "Berechtigungsfehler des SSH Skriptes";
"SshQuit" = "Das SSH Programm wurde unerwartet beendet";
"SshPermissionDenied" = "Berechtigung durch den SSH Server wurde nicht gewährt";
"SshConnectionClosed" = "Der SSH Server hat die Verbindung getrennt";

// errors with SSH tunnel after having established SSH connection
"TunnelNoConnection" = "Tunnelverbindung zum Server %@ auf Port %d konnte nicht augebaut werden";
"TunnelSocketErr" = "Fehler mit socket(): %s";
"TunnelConnectErr" = "Fehler mit connect(): %s";
"TunnelAdminProhibited" = "Der SSH Server erlaubt diesen Tunneltyp nicht";
"TunnelOther" = "Der SSH Server konnte keine Verbindung zum VNC Server herstellen";

// SSH prompts
"FirstTimeHeader" = "Verbindung wird zum ersten Mal aufgebaut";
"FirstTimeMessage" = "Die Echtheit der Server konnte nicht verifiziert werden. Der Server Fingerabdruck des Schlüssels ist %@. Sind Sie sicher, dass Sie die Verbindung fortsetzen wollen?";

// Connection Terminated
"ConnectionTerminated" = "Verbindung getrennt";
"Reconnect" = "Wiederverbinden";
"ServerClosed" = "Der Server hat die Verbindung getrennt";
"ServerError" = "Write to server: %s";
"ProtocolError" = "Protkoll Fehler";
"ZrleTooSmall" = "ZRLE encoding: rectangle contained insufficient data";
"ZrleUnknownSubencoding" = "ZRLE encoding: unknown subencoding %d encountered";
"ZlibHexInflateError" = "ZlibHex encoding: inflate error: %s";
"ZlibHexDeflateTooSmall" = "ZlibHex encoding: deflate size smaller than expected";
"ZlibNeedsDict" = "Zlib encoding: inflate needs a dictionary";
"ZlibInflateError" = "Zlib encoding: inflate error: %s";
"TightBadSubencoding" = "Tight encoding: unknown subencoding received";
"TightUnknownFilter" = "Tight encoding: unknown filter code %@ received.";
"TightZeroPalette" = "Tight encoding: palette with length 0 received";
"TightWrongJpeg" = "Tight encoding: Wrong JPEG data received.";
"UnknownRectangle" = "Unknown rectangle encoding %d";
"UnknownRectangleLastEncoding" = "Unknown rectangle encoding %d. (Previous encoding was %@)";
"TightInflateInitErrorWith" = "InflateInit error: %s.\n";
"TightInflateInitError" = "InflateInit error\n";
"TightInflateErr" = "Inflate error\n";
"ZlibInflateInitErr" = "Zlib encoding: inflateInit: %s.\n";
"ZlibHexInflateErr" = "ZlibHex inflate error: %s";
"InflateInit" = "Inflate initialization error: %d, %s";
"InflateError" = "Inflate error: %d, %s";
"InflateMem" = "Inflate: couldn't allocate memory";

// Fullscreen
"FullscreenHeader" = "Ihre Verbindung wechselt in den Vollbild Modus";
"Fullscreen" = "Vollbild";
"FullscreenReason1" = "Sie können in den Fenstermodus zurückkehren wenn Sie die entsprechende Tastenkombination drücken. ";
"FullscreenReason2" = " Sie können diese Tastenkombination in den Einstellungen ändern.";
"FullscreenNoKeyHeader" = "Warnung: Keine Tastenkombination um den Vollbild Modus zu verlassen";
"FullscreenNoKey" = "Es ist keine Tastenkombination festgelegt um in den Fenstermodus zurückzukehren. Sie können in den Einstellungen eine festlegen. Sind Sie sicher dass sie den Vollbild Modus aktivieren wollen?";

// Listener
"listenStart" = "Start";
"listenStop" = "Stop";
"listenRunning" = "Lauschen ist an";
"listenStopped" = "Lauschen ist aus";
"listenAcceptMessage" = "Verbindung von %@:%d";

// Rendezvous
"AddressResolveFailed" = "Addressenauflösung fehlgeschlagen";
"Resolving" = "Adressenauflösung...";

// Connection Info
"ConnectionStatistics" = "Bytes Received: %@\nBytes Represented: %@\nCompression: %.2f\nRectangles: %u\nEncodings:%@";
"ServerInfo" = "VNC Protocol Version: %d.%d\nVNC Screensize: %dx%d\nProtocol Parameters\n\tBits Per Pixel: %d\n\tDepth: %d\n\tByteorder: %@\n\tTruecolor: %@\n\tMaxValues (r/g/b): %d/%d/%d\n\tShift (r/g/b): %d/%d/%d";
"big-endian" = "big-endian";
"little-endian" = "little-endian";
"yes" = "yes";
"no" = "no";

// Paste to Remote Server
"PasteConversionHeader" = "Zwischenablage nicht kompatibel mit Latin-1";
"PasteConversionBody" = "Das VNC Protkoll unterstützt nur Zwischenablagen Text in der Latin-1 Enkodierung. Wollen Sie den Text trotzdem senden?";
"PasteAnyways" = "Trotzdem senden";

// FX
"VNC Plugin (Chicken)" = "VNC Plugin (Chicken)";
"Enter password to retry:" = "Passwort:";
"Reconnecting ..." = "Wiederverbinden ...";
"SSH Password:" = "SSH Passwort:";
"OK" = "OK";